tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/leonidas/.tsung/tsung.dtd" []>
<tsung loglevel="debug" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="60000"/>
  </clients>

  <servers>
    <server host="localhost" port="5200" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="1000" unit="second">
      <users maxnumber="30000" arrivalrate="200" unit="second"/>
    </arrivalphase>
  </load>

  <options>
    <option name="ports_range" min="1025" max="65535"/>
  </options>

  <sessions>
    <session name="websocket" probability="100" type="ts_websocket">
      <request>
        <websocket type="connect" path="/cable"/>
      </request>

      <request subst="true">
        <websocket type="message" frame="text">
          {"command":"subscribe","identifier":"{\"channel\":\"NoticeChannel\"}"}
        </websocket>
      </request>

      <for var="i" from="1" to="1000" incr="1">
        <thinktime min="10" max="60" random="true"/>
        <request subst="true">
          <websocket type="message" frame="text">
            {"command":"message","identifier":"{\"channel\":\"NoticeChannel\"}","data":"{\"username\":\"guest\",\"body\":\"test\",\"action\":\"publish_message\"}"}
          </websocket>
        </request>
      </for>
    </session>
  </sessions>
</tsung>